import java.util.ArrayList;

public class program {
    public static void main(String[] args) {
//        1. Подумать над структурой класса Ноутбук для магазина техники - выделить поля и методы. Реализовать в java.
//
//        2. Создать множество ноутбуков (ArrayList).
//
//        3. Отфильтровать ноутбуки их первоначального множества и вывести проходящие по условиям.
//        Например, спросить у пользователя минимальный размер оперативной памяти или конкретный цвет.
//        Выводить только те ноутбуки, что соответствуют условию.

        ArrayList<laptop> laptopArrayList = new ArrayList<>();

    }
}
